### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_api_management_api.wallet will be destroyed
  # (because azurerm_api_management_api.wallet is not in configuration)
  - resource "azurerm_api_management_api" "wallet" {
      - api_management_name   = "io-p-itn-platform-api-gateway-apim-01" -> null
      - api_type              = "http" -> null
      - description           = "IT-Wallet REST APIs" -> null
      - display_name          = "IT-Wallet" -> null
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/io-p-wallet-api;rev=1" -> null
      - is_current            = true -> null
      - is_online             = false -> null
      - name                  = "io-p-wallet-api" -> null
      - path                  = "api/wallet" -> null
      - protocols             = [
          - "https",
        ] -> null
      - resource_group_name   = "io-p-itn-common-rg-01" -> null
      - revision              = "1" -> null
      - subscription_required = false -> null
      - version               = "v1" -> null
      - version_set_id        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apiVersionSets/wallet-apis" -> null
        # (4 unchanged attributes hidden)

      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }
    }

  # azurerm_api_management_api_operation.wallet_catchall will be destroyed
  # (because azurerm_api_management_api_operation.wallet_catchall is not in configuration)
  - resource "azurerm_api_management_api_operation" "wallet_catchall" {
      - api_management_name = "io-p-itn-platform-api-gateway-apim-01" -> null
      - api_name            = "io-p-wallet-api" -> null
      - description         = "Forwards all GET requests to backend" -> null
      - display_name        = "GET Wallet Catch All" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/io-p-wallet-api/operations/get-wallet-catchall" -> null
      - method              = "*" -> null
      - operation_id        = "get-wallet-catchall" -> null
      - resource_group_name = "io-p-itn-common-rg-01" -> null
      - url_template        = "/*" -> null

      - request {
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_api_management_api_tag.psn will be destroyed
  # (because azurerm_api_management_api_tag.psn is not in configuration)
  - resource "azurerm_api_management_api_tag" "psn" {
      - api_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/wallet-api-v1;rev=1" -> null
      - id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/wallet-api-v1;rev=1/tags/psn" -> null
      - name   = "psn" -> null
    }

  # azurerm_api_management_api_tag.wallet will be destroyed
  # (because azurerm_api_management_api_tag.wallet is not in configuration)
  - resource "azurerm_api_management_api_tag" "wallet" {
      - api_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/wallet-api-v1;rev=1" -> null
      - id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apis/wallet-api-v1;rev=1/tags/it-wallet" -> null
      - name   = "it-wallet" -> null
    }

  # azurerm_api_management_api_version_set.wallet will be destroyed
  # (because azurerm_api_management_api_version_set.wallet is not in configuration)
  - resource "azurerm_api_management_api_version_set" "wallet" {
      - api_management_name = "io-p-itn-platform-api-gateway-apim-01" -> null
      - display_name        = "Wallet APIs" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/apiVersionSets/wallet-apis" -> null
      - name                = "wallet-apis" -> null
      - resource_group_name = "io-p-itn-common-rg-01" -> null
      - versioning_scheme   = "Segment" -> null
        # (3 unchanged attributes hidden)
    }

  # azurerm_api_management_product_api.wallet will be destroyed
  # (because azurerm_api_management_product_api.wallet is not in configuration)
  - resource "azurerm_api_management_product_api" "wallet" {
      - api_management_name = "io-p-itn-platform-api-gateway-apim-01" -> null
      - api_name            = "wallet-api-v1" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/products/it-wallet/apis/wallet-api-v1" -> null
      - product_id          = "it-wallet" -> null
      - resource_group_name = "io-p-itn-common-rg-01" -> null
    }

  # azurerm_api_management_tag.psn will be destroyed
  # (because azurerm_api_management_tag.psn is not in configuration)
  - resource "azurerm_api_management_tag" "psn" {
      - api_management_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01" -> null
      - display_name      = "psn" -> null
      - id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01/tags/psn" -> null
      - name              = "psn" -> null
    }

  # module.iam.azurerm_role_assignment.func_app_user_cdn_endpoint_contributor will be created
  + resource "azurerm_role_assignment" "func_app_user_cdn_endpoint_contributor" {
      + condition_version                = (known after apply)
      + description                      = "Allow Function App user to manage CDN endpoint"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "02746a5a-4e9d-49b8-b400-1fc9298fef2f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "CDN Endpoint Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Cdn/profiles/io-p-itn-wallet-cdnp-01/endpoints/io-p-itn-wallet-cdne-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_apps.module.function_app_support_autoscaler.azurerm_monitor_autoscale_setting.this will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-wallet-supp-as-01"
        name                = "io-p-itn-wallet-supp-as-01"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_app_service_plan_autoscaler"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "2.0.0"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ profile {
            name = "Default"

          ~ capacity {
              ~ default = 1 -> 2
              ~ minimum = 1 -> 2
                # (1 unchanged attribute hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

Plan: 1 to add, 1 to change, 7 to destroy.

Warning: Argument is deprecated

  with module.storage_accounts.azurerm_storage_queue.wallet-instance-creation-email-queue-01,
  on ../_modules/storage_accounts/storage_queue.tf line 3, in resource "azurerm_storage_queue" "wallet-instance-creation-email-queue-01":
   3:   storage_account_name = azurerm_storage_account.common.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 3 more similar warnings elsewhere)
```

</details>
